Revit 2027 API
FabricationPart.IsProductList Method
 Gets whether or not the fabrication part is a product list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsProductList()
Public Function IsProductList As Boolean
public:
bool IsProductList()
member IsProductList : unit -> bool
Return Value
Boolean
 Returns true if the fabrication part is a product list.
Exceptions
Exception | Condition
InvalidOperationException |  the fabrication part is not a product list.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace